Reports/ОтчетДНА.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<Report>		<InternalInfo>			<xr:GeneratedType name="ReportObject.ОтчетДНА" category="Object">				<xr:TypeId>92563d2a-f6d7-45e5-bcf8-a6f3eb0060e8</xr:TypeId>				<xr:ValueId>dad2f051-c473-4876-8bce-efbe3c912268</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="ReportManager.ОтчетДНА" category="Manager">				<xr:TypeId>3685f0a8-39a2-47b0-b4c7-363d46bb247c</xr:TypeId>				<xr:ValueId>0c87c41d-cda6-4c68-8f5e-95cb7d885beb</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ОтчетДНА</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Отчет ДНА</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultForm/>			<AuxiliaryForm/>			<MainDataCompositionSchema>Report.ОтчетДНА.Template.ОсновнаяСхемаКомпоновкиДанных</MainDataCompositionSchema>			<DefaultSettingsForm/>			<AuxiliarySettingsForm/>			<DefaultVariantForm/>			<VariantsStorage/>			<SettingsStorage/>			<IncludeHelpInContents>false</IncludeHelpInContents>			<ExtendedPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Template>ОсновнаяСхемаКомпоновкиДанных</Template>		</ChildObjects>	</Report></MetaDataObject>

AccumulationRegisters/ДвижениеЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<AccumulationRegister>		<InternalInfo>			<xr:GeneratedType name="AccumulationRegisterRecord.ДвижениеЗаказов" category="Record">				<xr:TypeId>d1665612-adc1-40aa-b545-9673135866f1</xr:TypeId>				<xr:ValueId>d8dfba19-7e5b-4bda-a936-8dca81ad23b8</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterManager.ДвижениеЗаказов" category="Manager">				<xr:TypeId>94596b33-5598-474d-ba5e-53a7d9ca4b74</xr:TypeId>				<xr:ValueId>35086a32-40b1-4dce-9bb7-af7eb4c92f63</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterSelection.ДвижениеЗаказов" category="Selection">				<xr:TypeId>37ab27af-4123-4529-a579-3ef9a0f94e69</xr:TypeId>				<xr:ValueId>fc2cc772-374f-4364-8dd9-d0a5904d39e0</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterList.ДвижениеЗаказов" category="List">				<xr:TypeId>b3dfb9d3-819e-4517-bde1-2a562b880abc</xr:TypeId>				<xr:ValueId>aac5f81f-ee21-4114-88b6-4498dc4540bf</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordSet.ДвижениеЗаказов" category="RecordSet">				<xr:TypeId>dc2e40a8-0428-415e-8b42-307a35f8e67c</xr:TypeId>				<xr:ValueId>9aeed50a-837f-4ce8-b5c9-9eeb7aae5b59</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="AccumulationRegisterRecordKey.ДвижениеЗаказов" category="RecordKey">				<xr:TypeId>183b3142-ea8f-45bc-933d-a80d296643d9</xr:TypeId>				<xr:ValueId>fb611d2e-b925-4d9a-ba12-8e20f6f22628</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ДвижениеЗаказов</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Движение заказов</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<DefaultListForm>AccumulationRegister.ДвижениеЗаказов.Form.ФормаСписка</DefaultListForm>			<AuxiliaryListForm/>			<RegisterType>Balance</RegisterType>			<IncludeHelpInContents>false</IncludeHelpInContents>			<StandardAttributes>				<xr:StandardAttribute name="RecordType">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSplitting>false</EnableTotalsSplitting>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Количество</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Количество</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:decimal</v8:Type>						<v8:NumberQualifiers>							<v8:Digits>10</v8:Digits>							<v8:FractionDigits>0</v8:FractionDigits>							<v8:AllowedSign>Nonnegative</v8:AllowedSign>						</v8:NumberQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Resource>			<Attribute>				<Properties>					<Name>ПредшествующаяТочкаРегистрации</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Предшествующая точка регистрации</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ТочкиРегистрации</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Attribute>			<Attribute>				<Properties>					<Name>Смена</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Смена</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Shift</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Смены</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Attribute>			<Attribute>				<Properties>					<Name>ДатаСмены</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Дата смены</v8:content>						</v8:item>						<v8:item>							<v8:lang>en</v8:lang>							<v8:content>Date of shift</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:dateTime</v8:Type>						<v8:DateQualifiers>							<v8:DateFractions>Date</v8:DateFractions>						</v8:DateQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>				</Properties>			</Attribute>			<Dimension>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>Index</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>ТочкаРегистрации</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Точка регистрации</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.ТочкиРегистрации</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>Index</Indexing>					<FullTextSearch>Use</FullTextSearch>					<UseInTotals>true</UseInTotals>				</Properties>			</Dimension>			<Form>ФормаСписка</Form>			<Command>				<Properties>					<Name>ДвижениеЗаказов</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Движение заказов</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Group>FormNavigationPanelSeeAlso</Group>					<CommandParameterType>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</CommandParameterType>					<ParameterUseMode>Single</ParameterUseMode>					<ModifiesData>false</ModifiesData>					<Representation>Auto</Representation>					<ToolTip/>					<Picture/>					<Shortcut/>					<OnMainServerUnavalableBehavior>Auto</OnMainServerUnavalableBehavior>				</Properties>			</Command>		</ChildObjects>	</AccumulationRegister></MetaDataObject>

Reports/ОтчетДНА/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СмещениеНачалаСмены = (6 * 60 * 60) + (45 * 60);
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	Период = ПараметрПериод.Значение.Дата;
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрНачалоПериода.Значение = НачалоДня(Период);
	ПараметрНачалоПериода.Использование = Истина;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрКонецПериода.Значение = КонецДня(Период);
	ПараметрКонецПериода.Использование = Истина;
	
	ПараметрТочкиРегистрацииМЕС = Настройки.ПараметрыДанных.Элементы.Найти("ТочкиРегистрацииМЕС");
	ТочкиРегистрацииМЕС = ПараметрТочкиРегистрацииМЕС.Значение;
	
	ТочкиРегистрацииOff = Новый Массив;
	ПараметрТочкиРегистрацииOff = Настройки.ПараметрыДанных.Элементы.Найти("ТочкиРегистрацииOff");
	Если ПараметрТочкиРегистрацииOff.Использование Тогда
		ТочкиРегистрацииOff = ПараметрТочкиРегистрацииOff.Значение;
	КонецЕсли;
	
	ТочкиПроверкиДляОстатков = Новый Массив;
	ПараметрТочкиПроверкиДляОстатков = Настройки.ПараметрыДанных.Элементы.Найти("ТочкиПроверкиДляОстатков");
	Если ПараметрТочкиПроверкиДляОстатков.Использование Тогда
		ТочкиПроверкиДляОстатков = ПараметрТочкиПроверкиДляОстатков.Значение;
	КонецЕсли;
	
	ПараметрТочкиПроверкиДляОборотов = Настройки.ПараметрыДанных.Элементы.Найти("ТочкиПроверкиДляОборотов");
	ТочкиПроверкиДляОборотов = ПараметрТочкиПроверкиДляОборотов.Значение;
	
	ТЗ_Периоды = Новый ТаблицаЗначений;
	ТЗ_Периоды.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ТЗ_Периоды.Колонки.Добавить("ТипПериода", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_Периоды.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТЗ_Периоды.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТЗ_Периоды.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	
	Для ы = 0 По 1 Цикл
		НоваяСтрока = ТЗ_Периоды.Добавить();
		НоваяСтрока.Порядок = ы;
		НоваяСтрока.ТипПериода = "Y";
		НоваяСтрока.Наименование = Строка(Год(Период) - ы);
		НоваяСтрока.ДатаНачала = НачалоГода(ДобавитьМесяц(Период, -(ы * 12)));
		НоваяСтрока.ДатаОкончания = КонецГода(ДобавитьМесяц(Период, -(ы * 12)));
	КонецЦикла;
	
	Для ы = 0 По 11 Цикл
		НоваяСтрока = ТЗ_Периоды.Добавить();
		НоваяСтрока.Порядок = ы + 2;
		НоваяСтрока.ТипПериода = "M";
		НоваяСтрока.Наименование = Формат(НачалоМесяца(ДобавитьМесяц(НачалоГода(Период), ы)), "ДФ='MMM гг'");
		НоваяСтрока.ДатаНачала = НачалоМесяца(ДобавитьМесяц(НачалоГода(Период), ы));
		НоваяСтрока.ДатаОкончания = КонецМесяца(ДобавитьМесяц(НачалоГода(Период), ы));
	КонецЦикла;
	
	ПерваяНеделяМесяца = НеделяГода(НачалоМесяца(Период));
	Для ы = 0 По 5 Цикл
		Если НачалоНедели(НачалоМесяца(Период) + ы * 7 * 24 * 60 * 60) > Период Тогда
			Прервать;
		КонецЕсли;
		НоваяСтрока = ТЗ_Периоды.Добавить();
		НоваяСтрока.Порядок = ы + 14;
		НоваяСтрока.ТипПериода = "W";
		НоваяСтрока.Наименование = Строка(ПерваяНеделяМесяца + ы);
		НоваяСтрока.ДатаНачала = НачалоНедели(НачалоМесяца(Период) + ы * 7 * 24 * 60 * 60);
		НоваяСтрока.ДатаОкончания = КонецНедели(НачалоМесяца(Период) + ы * 7 *24 * 60 * 60);
	КонецЦикла;
	
	Для ы = 0 По 6 Цикл
		НоваяСтрока = ТЗ_Периоды.Добавить();
		НоваяСтрока.Порядок = ы + 20;
		НоваяСтрока.ТипПериода = "D";
		НоваяСтрока.Наименование = Формат(НачалоДня(НачалоНедели(Период) + ы * 24 * 60 * 60), "ДФ=dd.MM.yy");
		НоваяСтрока.ДатаНачала = НачалоДня(НачалоНедели(Период) + ы * 24 * 60 * 60) + СмещениеНачалаСмены;
		НоваяСтрока.ДатаОкончания = КонецДня(НачалоНедели(Период) + ы * 24 * 60 * 60) + СмещениеНачалаСмены;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Периоды.Порядок КАК Порядок,
		|	Периоды.ТипПериода КАК ТипПериода,
		|	Периоды.Наименование КАК Наименование,
		|	Периоды.ДатаНачала КАК ДатаНачала,
		|	Периоды.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_Периоды
		|ИЗ
		|	&ТЗ_Периоды КАК Периоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвижениеЗаказовОбороты.Период КАК Период,
		|	ДвижениеЗаказовОбороты.Заказ КАК Заказ,
		|	ДвижениеЗаказовОбороты.КоличествоПриход КАК КоличествоПриход
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	РегистрНакопления.ДвижениеЗаказов.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ТочкаРегистрации В (&ТочкиРегистрацииМЕС)) КАК ДвижениеЗаказовОбороты
		|ГДЕ
		|	ДвижениеЗаказовОбороты.КоличествоПриход > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Периоды.Порядок КАК Порядок,
		|	ВТ_Периоды.ТипПериода КАК ТипПериода,
		|	ВТ_Периоды.Наименование КАК Наименование,
		|	ВТ_Заказы.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТ_ЗаказыПоПериодам
		|ИЗ
		|	ВТ_Периоды КАК ВТ_Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		|		ПО (ВТ_Заказы.Период МЕЖДУ ВТ_Периоды.ДатаНачала И ВТ_Периоды.ДатаОкончания)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвижениеЗаказовОбороты.Период КАК Период,
		|	ДвижениеЗаказовОбороты.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТ_ПериодыПрохожденияТочкиOff
		|ИЗ
		|	РегистрНакопления.ДвижениеЗаказов.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			ТочкаРегистрации В (&ТочкиРегистрацииOff)
		|				И Заказ В
		|					(ВЫБРАТЬ
		|						ВТ_ЗаказыПоПериодам.Заказ
		|					ИЗ
		|						ВТ_ЗаказыПоПериодам КАК ВТ_ЗаказыПоПериодам)) КАК ДвижениеЗаказовОбороты
		|ГДЕ
		|	ДвижениеЗаказовОбороты.КоличествоПриход > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонсерныОбороты.Заказ КАК Заказ,
		|	КонсерныОбороты.Консерн КАК Консерн,
		|	КонсерныОбороты.КоличествоПриход КАК КоличествоПриход
		|ПОМЕСТИТЬ ВТ_КонсерныПриходДляОстатков
		|ИЗ
		|	РегистрНакопления.Консерны.Обороты(
		|			,
		|			,
		|			,
		|			Заказ В
		|					(ВЫБРАТЬ
		|						ВТ_ЗаказыПоПериодам.Заказ
		|					ИЗ
		|						ВТ_ЗаказыПоПериодам КАК ВТ_ЗаказыПоПериодам)
		|				И Консерн.ТочкаПроверкиКачества В (&ТочкиПроверкиДляОстатков)) КАК КонсерныОбороты
		|ГДЕ
		|	КонсерныОбороты.КоличествоПриход > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонсерныОбороты.Заказ КАК Заказ,
		|	КонсерныОбороты.Консерн КАК Консерн,
		|	КонсерныОбороты.КоличествоРасход КАК КоличествоРасход
		|ПОМЕСТИТЬ ВТ_КонсерныРасходДляОстатков
		|ИЗ
		|	РегистрНакопления.Консерны.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Заказ В
		|					(ВЫБРАТЬ
		|						ВТ_ЗаказыПоПериодам.Заказ
		|					ИЗ
		|						ВТ_ЗаказыПоПериодам КАК ВТ_ЗаказыПоПериодам)
		|				И Консерн.ТочкаПроверкиКачества В (&ТочкиПроверкиДляОстатков)) КАК КонсерныОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыПрохожденияТочкиOff КАК ВТ_ПериодыПрохожденияТочкиOff
		|		ПО КонсерныОбороты.Заказ = ВТ_ПериодыПрохожденияТочкиOff.Заказ
		|ГДЕ
		|	КонсерныОбороты.КоличествоРасход > 0
		|	И КонсерныОбороты.Период < ЕСТЬNULL(ВТ_ПериодыПрохожденияТочкиOff.Период, ДАТАВРЕМЯ(3999, 12, 31))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыПоПериодам.Порядок КАК Порядок,
		|	ВТ_ЗаказыПоПериодам.ТипПериода КАК ТипПериода,
		|	ВТ_ЗаказыПоПериодам.Наименование КАК Наименование,
		|	ВТ_ЗаказыПоПериодам.Заказ КАК Заказ,
		|	ЕСТЬNULL(ВТ_КонсерныПриходДляОстатков.КоличествоПриход, 0) - ЕСТЬNULL(ВТ_КонсерныРасходДляОстатков.КоличествоРасход, 0) КАК КоличествоКонсернов
		|ПОМЕСТИТЬ ВТ_ЗаказыИКонсерны
		|ИЗ
		|	ВТ_ЗаказыПоПериодам КАК ВТ_ЗаказыПоПериодам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонсерныПриходДляОстатков КАК ВТ_КонсерныПриходДляОстатков
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонсерныРасходДляОстатков КАК ВТ_КонсерныРасходДляОстатков
		|			ПО ВТ_КонсерныПриходДляОстатков.Заказ = ВТ_КонсерныРасходДляОстатков.Заказ
		|				И ВТ_КонсерныПриходДляОстатков.Консерн = ВТ_КонсерныРасходДляОстатков.Консерн
		|		ПО ВТ_ЗаказыПоПериодам.Заказ = ВТ_КонсерныПриходДляОстатков.Заказ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗаказыПоПериодам.Порядок,
		|	ВТ_ЗаказыПоПериодам.ТипПериода,
		|	ВТ_ЗаказыПоПериодам.Наименование,
		|	ВТ_ЗаказыПоПериодам.Заказ,
		|	ЕСТЬNULL(КонсерныОбороты.КоличествоПриход, 0)
		|ИЗ
		|	ВТ_ЗаказыПоПериодам КАК ВТ_ЗаказыПоПериодам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Консерны.Обороты(, , , Консерн.ТочкаПроверкиКачества В (&ТочкиПроверкиДляОборотов)) КАК КонсерныОбороты
		|		ПО ВТ_ЗаказыПоПериодам.Заказ = КонсерныОбороты.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыИКонсерны.Порядок КАК Порядок,
		|	ВТ_ЗаказыИКонсерны.ТипПериода КАК ТипПериода,
		|	ВТ_ЗаказыИКонсерны.Наименование КАК Наименование,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаказыИКонсерны.Заказ) КАК КоличествоЗаказов,
		|	СУММА(ВТ_ЗаказыИКонсерны.КоличествоКонсернов) КАК КоличествоКонсернов
		|ПОМЕСТИТЬ ВТ_Группировка
		|ИЗ
		|	ВТ_ЗаказыИКонсерны КАК ВТ_ЗаказыИКонсерны
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ЗаказыИКонсерны.Порядок,
		|	ВТ_ЗаказыИКонсерны.ТипПериода,
		|	ВТ_ЗаказыИКонсерны.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Группировка.Порядок КАК Порядок,
		|	ВТ_Группировка.ТипПериода КАК ТипПериода,
		|	ВТ_Группировка.Наименование КАК НаименованиеПериода,
		|	""ДНА"" КАК НаименованиеПараметра,
		|	ВЫБОР
		|		КОГДА ВТ_Группировка.КоличествоЗаказов = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_Группировка.КоличествоКонсернов / ВТ_Группировка.КоличествоЗаказов
		|	КОНЕЦ КАК Количество
		|ИЗ
		|	ВТ_Группировка КАК ВТ_Группировка";
	
	Запрос.УстановитьПараметр("ТЗ_Периоды", ТЗ_Периоды);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ДобавитьМесяц(Период, -12)));
	Запрос.УстановитьПараметр("КонецПериода", КонецГода(Период));
	Запрос.УстановитьПараметр("ТочкиРегистрацииМЕС", ТочкиРегистрацииМЕС);
	Запрос.УстановитьПараметр("ТочкиРегистрацииOff", ТочкиРегистрацииOff);
	Запрос.УстановитьПараметр("ТочкиПроверкиДляОстатков", ТочкиПроверкиДляОстатков);
	Запрос.УстановитьПараметр("ТочкиПроверкиДляОборотов", ТочкиПроверкиДляОборотов);
	ТЗ_Источник = Запрос.Выполнить().Выгрузить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ТЗ_ДНА", ТЗ_Источник);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти
